app/controllers/admins/artists_controller.rb

SELECT  "artists".* FROM "artists" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @name = Artist.new
    @artist = Artist.page(params[:page])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "artists".* FROM "artists"
---
  def edit
    @name = Artist.find(params[:id])
    @artist = Artist.all

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "KANABOON"], ["created_at", "2019-07-24 01:52:09.106458"], ["updated_at", "2019-07-24 01:52:09.106458"]]
---
  def create
    name = Artist.new(artist_params)
    name.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "a"], ["updated_at", "2019-07-21 04:41:36.677498"], ["id", 1]]
---
  def update
    name = Artist.find(params[:id])
    name.update(artist_params)