app/controllers/admins/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        @item = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "artists".* FROM "artists"
SELECT "labels".* FROM "labels"
SELECT "jenres".* FROM "jenres"
---
    def edit
        @item = Item.find(params[:id])
        @item.disks.build
        @artist = Artist.all
        @label = Label.all
        @jenre = Jenre.all

SELECT "artists".* FROM "artists"
SELECT "labels".* FROM "labels"
SELECT "jenres".* FROM "jenres"
---
    def new
        @item = Item.new
        @item.disks.build
        @artist = Artist.all
        @label = Label.all
        @jenre = Jenre.all

INSERT INTO "items" ("artist_id", "label_id", "title", "price", "status", "jacket_image_id", "stock", "created_at", "updated_at", "jenre_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        item = Item.new(item_params)
        item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "artist_id" = ?, "jacket_image_id" = ?, "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["artist_id", 5], ["jacket_image_id", nil], ["stock", 2], ["updated_at", "2019-07-24 02:02:47.990398"], ["id", 1]]
---
    def update
        item = Item.find(params[:id])
        item.update(item_params)