app/controllers/admins/jenres_controller.rb

SELECT "jenres".* FROM "jenres"
---
  def index
    @name = Jenre.new
    @jenre = Jenre.all

SELECT  "jenres".* FROM "jenres" WHERE "jenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "jenres".* FROM "jenres"
---
  def edit
    @name = Jenre.find(params[:id])
    @jenre = Jenre.all

INSERT INTO "jenres" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2019-07-24 01:49:22.153975"], ["updated_at", "2019-07-24 01:49:22.153975"], ["name", "ロック"]]
---
  def create
    name = Jenre.new(jenre_params)
    name.save