app/controllers/admins/labels_controller.rb

SELECT  "labels".* FROM "labels" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @name = Label.new
    @label = Label.page(params[:page])

SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "labels".* FROM "labels"
---
  def edit
    @name = Label.find(params[:id])
    @label = Label.all

INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ソニー"], ["created_at", "2019-07-24 01:51:38.560779"], ["updated_at", "2019-07-24 01:51:38.560779"]]
---
  def create
    name = Label.new(label_params)
    name.save