app/views/admins/items/show.html.erb


    <% @item.disks.each do |disk| %>
---
SELECT "disks".* FROM "disks" WHERE "disks"."item_id" = ?  [["item_id", 1]]