app/controllers/users/items_controller.rb

    def index
        @cd = Item.all
---
SELECT "items".* FROM "items"