app/controllers/users/users_controller.rb

UPDATE "users" SET "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["address", "東京都"], ["updated_at", "2019-07-28 06:31:59.461997"], ["id", 1]]
---
    def update
        @user = current_user
        @user.update(user_params)